Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Laszlo Hars: For advice about data structures and algorithms, which helped greatly speed up arrays and dynamic variables.
ja: Laszlo Hars：データ構造とアルゴリズムに関するアドバイスで、配列と動的変数のスピードアップに大きく貢献した。

source: Left: Left-aligns the column's text, which is the initial default for every column.
ja: Left：カラムのテキストを左寄せにします。これは、すべてのカラムの初期設定値です。

source: Left: Left-justifies the control's text within its available width.
ja: Left：コントロールのテキストを使用可能な幅の範囲内で左寄せにします。

source: Limitation: AutoHotkey's remapping feature described below is generally not as pure and effective as remapping directly via the Windows registry.
ja: 制限以下に説明するAutoHotkeyのリマッピング機能は、一般的にWindowsレジストリ経由で直接リマッピングするほど純粋で効果的ではありません。

source: Line breaks are meaningful: Line breaks generally act as a statement separator, terminating the previous function call or other statement.
ja: 改行の意味：改行は一般的にステートメントの区切りとして機能し、前の関数呼び出しやその他のステートメントを終了させます。

source: Line continuation: Long lines can be divided up into a collection of smaller ones to improve readability and maintainability.
ja: 行の継続：長い行を小さな行の集まりに分割して、読みやすさや保守性を向上させることができます。

source: Line: The line number at which the error occurred, or at which the Error object was constructed.
ja: Line：エラーが発生した行番号、またはErrorオブジェクトが構築された行番号です。

source: Lines: Specify -Lines (minus Lines) to avoid displaying a network of lines connecting parent items to their children.
ja: Lines：親アイテムと子アイテムを結ぶ線のネットワークを表示しないようにするには、-Lines（マイナスLines）を指定します。

source: List item text:
ja: リスト項目のテキスト：

source: List: Shows a small-icon view in list format, which displays the icons in columns.
ja: List：アイコンを列挙して表示するリスト形式のスモールアイコンビューを表示します。

source: Ln: If this option is not present, the current user's locale is used to format the string.
ja: Ln：このオプションがない場合、現在のユーザーのロケールが文字列の書式に使用されます。

source: LocalSameAsGlobal: Before the script starts to run, display a warning for each undeclared local variable which has the same name as a global variable.
ja: LocalSameAsGlobal：スクリプトの実行前に、グローバル変数と同じ名前の未宣言のローカル変数に対して警告を表示するようにします。

source: Locale: The comparison is not case-sensitive according to the rules of the current user's locale.
ja: Locale：比較は、現在のユーザーのロケールのルールに従って、大文字と小文字を区別しない。

source: Locale: The search is not case-sensitive according to the rules of the current user's locale.
ja: Locale：検索では、現在のユーザーのロケールの規則に従って大文字と小文字は区別されません。

source: Logical bit shift right (>>>).
ja: 論理ビットの右シフト（>>）。

source: Logical-NOT.
ja: 論理否定。

source: Logical-not (!): If the operand is blank or 0, the result of applying logical-not is 1, which means "true".
ja: 論理否定（!）：オペランドが空白または0の場合、論理否定を適用した結果は1、つまり「真」を意味する。

source: Logical: Like Locale, but digits in the strings are considered as numerical content rather than text.
ja: Logical：Localeと似ているが、文字列中の数字はテキストではなく数値コンテンツとみなされる。

source: Logical: Same as CaseLocale except that any sequences of digits in the text are treated as true numbers rather than mere characters.
ja: Logical：CaseLocaleと同じですが、テキスト中の数字列が単なる文字ではなく、真の数字として扱われる点が異なります。

source: Look-ahead and look-behind assertions: The groups (?=...), (?!...), (?<=...), and (?<!...) are called assertions because they demand a condition to be met but don't consume any characters.
ja: ルックアヘッドとルックビハインドのアサーション：グループ(?=...)、(?!..)、(?<=...)、(?<!...)は、条件を満たすことを要求するが、文字を消費しないので、アサーションと呼ばれる。

source: M: Modified keystrokes such as Ctrl+A through Ctrl+Z are recognized and transcribed if they correspond to real ASCII characters.
ja: M：Ctrl+A からCtrl+Zのような修飾されたキー操作は、実際のASCII文字に対応する場合に認識され、転写されます。

source: M: Multi-select.
ja: M： マルチセレクトです。

source: MPRESS official website (downloads and information):
ja: MPRESS公式サイト（ダウンロードと情報）：

source: MPRESS official website (downloads and information): http://www.matcode.com/mpress.htm
ja: MPRESS公式サイト（ダウンロードと情報）：http://www.matcode.com/mpress.htm

source: Marcus Sonntag (Ultra): For the research, design, coding, and testing of DllCall.
ja: Marcus Sonntag（Ultra）： DllCallのリサーチ、デザイン、コーディング、テスト。

source: Match anywhere: By default, a regular expression matches a substring anywhere inside the string to be searched.
ja: どこでもマッチする：デフォルトでは、正規表現は検索される文字列内の任意の部分文字列にマッチします。

source: Match.Count: Returns the overall number of subpatterns (capturing groups), which is also the maximum value for N.
ja: Match.Count：Nの最大値でもある、全体のサブパターン（捕獲グループ）数を返す。

source: Match.Len, Match.Len[N] or Match.Len(N):
ja: Match.Len, Match.Len[N] または Match.Len(N)：

source: Match.Len, Match.Len[N] or Match.Len(N): Returns the length of the overall match or a captured subpattern.
ja: Match.Len、Match.Len[N] または Match.Len(N)：全体的なマッチの長さ、またはキャプチャしたサブパターンの長さを返します。

source: Match.Mark: Returns the NAME of the last encountered (*MARK:NAME), when applicable.
ja: Match.Mark：最後に出会った(*MARK:NAME)のNAMEを、該当する場合に返します。

source: Match.N: Shorthand for Match["N"], where N is any unquoted name or number which does not conflict with a defined property (listed above).
ja: Match.N：Match["N"]の略記で、Nは定義されたプロパティ（上記一覧）と衝突しない任意の引用されていない名前または数字です。

source: Match.Name[N] or Match.Name(N):
ja: Match.Name[N] または Match.Name(N)：

source: Match.Name[N] or Match.Name(N): Returns the name of the given subpattern, if it has one.
ja: Match.Name[N] または Match.Name(N)：与えられたサブパターンがある場合、その名前を返します。

source: Match.Pos, Match.Pos[N] or Match.Pos(N):
ja: Match.Pos, Match.Pos[N] または Match.Pos(N)：

source: Match.Pos, Match.Pos[N] or Match.Pos(N): Returns the position of the overall match or a captured subpattern.
ja: Match.Pos、Match.Pos[N] または Match.Pos(N)：全体一致の位置、または取り込んだサブパターンの位置を返します。

source: Match[] or Match[N]:
ja: Match[] または Match[N]：

source: Match[] or Match[N]: Returns the overall match or a captured subpattern.
ja: Match[] または Match[N]：全体的なマッチ、またはキャプチャしたサブパターンを返します。

source: Max: launch maximized
ja: Max：最大化して起動

source: Maximize: Maximizes and activates the window.
ja: Maximize：ウィンドウを最大化し、アクティブ化します。

source: MaximizeBox: Enables the maximize button in the title bar.
ja: MaximizeBox：タイトルバーの最大化ボタンを有効にします。

source: Maximum 7 ongoing calls: The thread displaying a message box can typically be interrupted, allowing the new thread to display its own message box before the previous call returns.
ja: 最大で7回の通話が可能：メッセージボックスを表示しているスレッドは、通常、中断することができ、前の呼び出しが戻る前に新しいスレッドが独自のメッセージボックスを表示することができます。

source: Maximum 7 ongoing calls:
ja: 最大で7回の通話が可能：

source: Maximum length: 253 characters.
ja: 最大文字数：253文字。

source: Member access.
ja: 会員アクセス。

source: MemoryError: A memory allocation failed.
ja: MemoryError：メモリの割り当てに失敗しました。

source: Menu: Affects the Menu.Show method when coordinates are specified for it.
ja: Menu：Menu.Showメソッドに座標が指定されている場合、その座標に影響します。

source: Message: An error message.
ja: Message：エラーメッセージです。

source: Method 1: Precede each literal quote mark with ` (back-tick, back-quote or grave accent).
ja: 方法1：各リテラルの引用符の前に`（バックティック、バッククオート、グレイブアクセント）を付ける。

source: Method 2: Enclose the command line in single quotes instead of double quotes.
ja: 方法2：コマンドラインをダブルクォーテーションではなく、シングルクォーテーションで囲む。

source: Min: launch minimized
ja: Min：最小化して起動

source: MinSize and MaxSize:
ja: MinSize および MaxSize:

source: MinSize and MaxSize: Determines the minimum and/or maximum size of the window, such as when the user drags its edges to resize it.
ja: MinSize および MaxSize：ユーザーがウィンドウの端をドラッグしてサイズを変更するときなど、ウィンドウの最小および最大サイズを決定します。

source: Minimize: Minimizes the window and activates the one beneath it.
ja: Minimize：ウィンドウを最小化し、その下のウィンドウをアクティブにします。

source: MinimizeBox (present by default):
ja: MinimizeBox（デフォルトで存在）：

source: MinimizeBox (present by default): Enables the minimize button in the title bar.
ja: MinimizeBox（デフォルトで存在）：タイトルバーの最小化ボタンを有効にします。

source: Mode 1 (Position): Specify the X and Y coordinates relative to the upper left corner of the target window's client area.
ja: モード1（ポジション）です：ターゲットウィンドウのクライアント領域の左上隅を基準としたX、Y座標を指定します。

source: Modifier State: When Send is required to change the state of the Win or Alt modifier keys (such as if the user was holding one of those keys), it may inject additional keystrokes (Ctrl by default) to prevent the Start menu or window menu from appearing.
ja: モディファイアの状態：Sendは、WinまたはAlt修飾キーの状態を変更する必要がある場合（ユーザーがこれらのキーのいずれかを保持している場合など）、スタートメニューやウィンドウメニューが表示されないようにするために追加のキーストローク（デフォルトではCtrl）を注入することができます。

source: Modifier State:
ja: モディファイアの状態：

source: Modifiers: Unlike a normal hotkey, custom combinations act as though they have the wildcard (*) modifier by default.
ja: モディファイア：通常のホットキーとは異なり、カスタムの組み合わせは、デフォルトでワイルドカード（*）モディファイアを持つように動作します。

source: Mouse: The user's keyboard and mouse input is ignored while a Click, MouseMove, MouseClick, or MouseClickDrag is in progress (the traditional SendEvent mode only).
ja: Mouse：Click、MouseMove、MouseClick、または、MouseClickDragの実行中は、ユーザーのキーボードやマウスの入力は無視されます（従来のSendEventモードの場合のみ）。

source: MouseMove: The mouse cursor will not move in response to the user's physical movement of the mouse (DirectInput applications are a possible exception).
ja: MouseMove：マウスカーソルは、ユーザーのマウスの物理的な動きに反応して動くことはありません（DirectInputアプリケーションは例外となる可能性があります）。

source: MouseMoveOff: Allows the user to move the mouse cursor.
ja: MouseMoveOff：マウスカーソルの移動を許可します。

source: MsgBox: Show a message box describing the warning.
ja: MsgBox：警告の内容を説明するメッセージボックスを表示します。

source: Multi: Multi-select.
ja: Multi： マルチセレクトです。

source: Multi: Specify -Multi (minus Multi) to prevent the user from selecting more than one row at a time.
ja: Multi：-Multi（マイナスMulti）を指定すると、一度に複数の行を選択できないようにすることができます。

source: Multiple Joysticks:
ja: 複数のジョイスティック

source: Multiple controllers: If the computer has more than one controller and you want to use one beyond the first, include the controller number (max 16) in front of the control name.
ja: 複数のコントローラー：コンピュータに複数のコントローラがあり、最初のコントローラ以外のコントローラを使用する場合は、コントロール名の前にコントローラ番号（最大16）を含めます。

source: Multiply (*): The result is an integer if both inputs are integers; otherwise, it is a floating point number.
ja: 乗算（*）：それ以外の場合は浮動小数点数。

source: N: Numeric sort.
ja: N：数値ソート。

source: N: Specify for N the new width of the column, in pixels.
ja: N：Nに対して、列の新しい幅をピクセル単位で指定します。

source: NA: May improve reliability.
ja: NA：信頼性を向上させる可能性がある。

source: NA: Shows the window without activating it.
ja: NA：ウィンドウをアクティブにせずに表示します。

source: Name: The name of a process is usually the same as its executable (without path), e.g. notepad.exe or winword.exe.
ja: 名前：プロセスの名前は通常、notepad.exeやwinword.exeなどの実行ファイルと同じです（パスなし）。

source: Name: The name of the object's default interface.
ja: Name：オブジェクトのデフォルトインターフェイスの名前。

source: Names: Label names are not case-sensitive (for ASCII letters), and may consist of letters, numbers, underscore and non-ASCII characters.
ja: 名前：ラベル名は大文字と小文字を区別せず（ASCII文字）、アルファベット、数字、アンダースコア、非ASCII文字で構成されます。

source: Names: Variable and function names are not case sensitive (for example, CurrentDate is the same as currentdate).
ja: 名前：変数名と関数名は大文字と小文字を区別しません（例えば、CurrentDateは currentdateと同じです）。

source: Names: Variable and function names are not case-sensitive (for example, CurrentDate is the same as currentdate).
ja: 名前：変数名と関数名は大文字と小文字を区別しません（例えば、CurrentDateはcurrentdateと同じです）。

source: Native encoding: Although AutoHotkey provides ways to work with text in various encodings, the built-in functions--and to some degree the language itself--all assume string values to be in one particular encoding.
ja: ネイティブエンコーディング：AutoHotkeyは様々なエンコーディングのテキストを扱う方法を提供していますが、組み込み関数、そしてある程度言語自体が、すべて文字列値がある特定のエンコーディングであることを前提としています。

source: No typed variables: Variables have no explicitly defined type; instead, a value of any type can be stored in any variable (excluding constants and built-in variables).
ja: 型なし変数：変数には明示的に定義された型がなく、任意の型の値を任意の変数に格納することができます（定数および組み込み変数を除く）。

source: NoActivate: Unminimizes or unmaximizes the window, if necessary.
ja: NoActivate：必要に応じて、ウィンドウの最小化または最大化を解除します。

source: NoSort: Prevents a user's click on this column from having any automatic sorting effect.
ja: NoSort：このカラムをユーザーがクリックしても、自動的にソートされないようにします。

source: NoSort: Turns off the automatic sorting that occurs when the user clicks a column header.
ja: NoSort：ユーザーがカラムヘッダをクリックしたときに発生する自動ソートをオフにします。

source: NoSortHdr: Prevents the header from being clickable.
ja: NoSortHdr：ヘッダーがクリックできないようにする。

source: Note: "Char*" is not the same as "Str" because "Char*" passes the address of an 8-bit number, whereas "Str" passes the address of a series of characters, which may be either 16-bit (Unicode) or 8-bit (for "AStr"), depending on the version of AutoHotkey.
ja: 注意：「Char*」は"Str"と同じではありません。「Char*」は8ビット数値のアドレスを渡すのに対し、"Str"は一連の文字のアドレスを渡しますが、これはAutoHotkeyのバージョンによって16ビット（ユニコード）または8ビット（「AStr」の場合）であることがあります。

source: Note: Static initializers such as static my_static_array := [] are evaluated only once, the first time they are reached during execution, so typically do not require the use of IsSet.
ja: 注： static my_static_array := []のような静的初期化子は、実行中に最初に到達したときに一度だけ評価されるため、通常、IsSetの使用は必要ありません。

source: Note: Text mode may be more reliable.
ja: 注： テキストモードの方が信頼性が高い場合があります。

source: Note: 2>&1 causes stderr to be redirected to stdout, while 2>Filename redirects only stderr to a file.
ja: 注： 2>&1はstderrをstdoutにリダイレクトさせ、2>Filenameは、stderrのみをファイルにリダイレクトさせる。

source: Note: static init := somefunction() can no longer be used to auto-execute somefunction.
ja: 注： static init := somefunction()は、somefunctionの自動実行には使えなくなりました。

source: Note: Dest is the actual path and name that the directory will have after it is moved; it is not the directory into which Source is moved (except for the known limitation mentioned below).
ja: 注意：Destは、移動後のディレクトリが持つ実際のパスと名前であり、Sourceが移動するディレクトリではありません（後述の既知の制限を除きます）。

source: Note: Length is measured in characters, whereas buffer sizes are usually measured in bytes, as is StrPut's return value.
ja: 注： 長さは文字単位で測定されるが、バッファ・サイズは通常バイト単位で測定される。

source: Note: PressDuration also produces a delay after any change to the modifier key state (Ctrl, Alt, Shift, and Win) needed to support the keys being sent.
ja: 注意：PressDurationは、送信されるキーをサポートするために必要な修飾キー状態（Ctrl、Alt、Shift、Win）の変更後にも遅延を発生させることができます。

source: Note: A line that begins with a comma (or any other operator) is automatically appended to the line above it.
ja: 注：カンマ（またはその他の演算子）で始まる行は、自動的にその上の行に追加される。

source: Note: A negative Base combined with a fractional Exponent such as (-2)**0.5 is not supported; attempting it will cause an exception to be thrown.
ja: 注意：(-2)**0.5のような負の基数と小数の指数を組み合わせたものはサポートされていません。

source: Note: A negative base combined with a fractional exponent such as (-2)**0.5 is not supported; attempting it will cause an exception to be thrown.
ja: 注意： (-2)**0.5のような負の底と小数の指数を組み合わせたものはサポートされていません。

source: Note: A variable cannot be created by a dynamic reference, but existing variables can be assigned.
ja: 注：動的参照によって変数を作成することはできませんが、既存の変数を割り当てることは可能です。

source: Note: All objects which derive from Object have additional shared behaviour, properties and methods.
ja: 注： Objectから派生したすべてのオブジェクトは、さらに共有の動作、プロパティ、メソッドを持ちます。

source: Note: All options except D, Z, and U are ignored when Callback is specified (though N, C, and CL still affect how duplicates are detected).
ja: 注： Callbackを指定したときは、D、Z、U以外のすべてのオプションは無視されます。ただし、N、C、CLは重複の検出方法にも影響します。

source: Note: Any Duration less than 17 might result in a shorter actual duration or immediate interruption, since the system tick count has a minimum resolution of 10 to 16 milliseconds.
ja: 注：システムのティックカウントの最小分解能は10～16ミリ秒であるため、Durationが17未満の場合、実際の持続時間が短くなったり、即座に中断したりする可能性がある。

source: Note: As capital letters are produced by sending Shift, A produces a different effect in some programs than a.
ja: 注意：Shiftを送ると大文字が出るように、Aはプログラムによってはaとは違う効果が出ます。

source: Note: AutoHotkey v2 natively uses Unicode and does not have an ANSI version.
ja: 注：AutoHotkey v2はネイティブでUnicodeを使用し、ANSIバージョンはありません。

source: Note: Characters sent using any of the above methods usually do not trigger keyboard shortcuts or hotkeys.
ja: 注：上記の方法で送信された文字は、通常、キーボードショートカットやホットキーは作動しません。

source: Note: Codes that contain letters might use either uppercase or lowercase.
ja: 注：文字を含むコードは大文字でも小文字でもよい。

source: Note: Currently, the compression state of files cannot be changed with this function.
ja: 注： 現在、この関数で圧縮されたファイルを変更することはできません。

source: Note: Custom combinations only support combinations of exactly two keys/mouse buttons, and cannot be combined with other modifiers, such as !#^+ for Alt, Win, Ctrl and Shift.
ja: 注：カスタムの組み合わせは、ちょうど2つのキー/マウスボタンの組み合わせにのみ対応しており、Alt、Win、Ctrl、Shiftのための!#^+など、他の修飾子との組み合わせはできない。

source: Note: Date and time math can be performed with DateAdd and DateDiff.
ja: 注：日付と時刻の計算はDateAddと DateDiffで実行できる。

source: Note: Date-time values can be compared, added to, or subtracted from via DateAdd and DateDiff.
ja: 注意：DateAdd、DateDiffにより、日付時刻の値を比較、加算、減算することができます。

source: Note: Declaring the required version with #Requires at the top of the main file eliminates any ambiguity.
ja: 注：メインファイルの先頭に#Requiresを付けて必須バージョンを宣言することで、曖昧さをなくすことができる。

source: Note: Dn and Tn may be repeated to put more than one option into effect, such as this example: FormatTime("20040228 D2 D4 T1 T8")
ja: 注：DnとTnは、この例のように、複数の選択肢を有効にするために繰り返すことができる：FormatTime("20040228 D2 D4 T1 T8")

source: Note: Due to reliance on null-termination, many built-in functions and most expression operators do not support strings with embedded null characters, and instead read only up to the first null character.
ja: 注：ヌル終端処理に依存しているため、多くの組み込み関数とほとんどの式演算子はヌル文字が埋め込まれた文字列をサポートせず、代わりに最初のヌル文字までしか読みません。

source: Note: Even if defined inside the loop body, a nested function which refers to a loop variable cannot see or change the current iteration's value.
ja: 注：ループ本体内で定義されていても、ループ変数を参照するネストされた関数は、現在の反復の値を見たり変更したりすることはできません。

source: Note: For combinations with standard modifier keys, it is usually better to use the standard syntax.
ja: 注：標準的な修飾キーとの組み合わせの場合、通常は標準的な構文を使用する方がよい。

source: Note: For historical reasons, the following button and control names begin with Joy, which stands for joystick.
ja: 注：歴史的な理由から、以下のボタンとコントロールの名前はジョイスティックを意味するJoyで始まります。

source: Note: Format can perform additional formatting at the same time, such as padding with 0s or spaces, or formatting numbers as hexadecimal instead of decimal.
ja: 注：Formatは、0やスペースによるパディングや、数値を10進数ではなく16進数でフォーマットするなど、追加のフォーマットを同時に実行することができます。

source: Note: Hotkey functions are assume-local by default and therefore cannot assign to global variables without a declaration.
ja: 注：ホットキー関数はデフォルトでassume-localであるため、宣言なしでグローバル変数に代入することはできません。

source: Note: If FilePattern is a single folder rather than a wildcard pattern, it will always be operated upon regardless of this setting.
ja: 注意：FilePatternがワイルドカードパターンではなく、単一のフォルダの場合、この設定に関係なく常に操作されます。

source: Note: If conversion between code pages is necessary, the required buffer size may differ from the size of the source string.
ja: 注：コード・ページ間の変換が必要な場合、必要なバッファ・サイズはソース文字列のサイズと異なる場合がある。

source: Note: If the input text is visible (such as in an editor) and the arrow keys or other means are used to navigate within it, Backspace will still remove the last character rather than the one behind the caret (insertion point).
ja: 注：入力テキストが表示されていて（エディターなど）、その中を矢印キーなどで移動する場合、Backspaceはキャレット（挿入点）の後ろの文字ではなく、やはり最後の文字を削除します。

source: Note: If this parameter is specified but the hotstring is disabled from a previous use of this function, the hotstring will remain disabled.
ja: 注意：このパラメータを指定しても、以前にこの機能を使用したときにホットストリングが無効になっていた場合は、ホットストリングは無効のままとなります。

source: Note: If you have trouble getting a script to recognize your controller, specify a controller number other than 1 even though only a single controller is present.
ja: 注：スクリプトがコントローラを認識できない場合は、コントローラが1つしかなくても、コントローラ番号を1以外に指定してください。

source: Note: If you press the following button, ActiveX is used to create a config file named 'chm_config.js' in the same directory as the CHM file, with the following content:
ja: 注：次のボタンを押すと、ActiveXを使用して、CHMファイルと同じディレクトリに'chm_config.js'という名前の構成ファイルを作成します。内容は次のとおりです：

source: Note: If your keyboard layout has AltGr instead of RAlt, you can probably use it as a hotkey prefix via <^>! as described here.
ja: 注：キーボードレイアウトにRAltの代わりにAltGrがある場合、ここで説明されているように、<^>! を介してホットキーのプレフィックスとして使用することができます。

source: Note: In mode 1, the X and Y option letters of the Options parameter are ignored.
ja: 注意：モード1では、OptionsパラメータのXとYのオプション文字は無視されます。

source: Note: In this example, .ptr could have been omitted since the Ptr arg type permits objects with a Ptr property.
ja: 注：この例では、Ptrarg型がPtrプロパティを持つオブジェクトを許可しているため、.ptrを省略することができました。

source: Note: Increasing the message-check interval too much may reduce the responsiveness of various events such as GUI window repainting.
ja: 注意：メッセージチェックの間隔を広げすぎると、GUIウィンドウの再描画など各種イベントの応答性が低下する場合があります。

source: Note: It is not necessary to escape a semicolon which has any character other than space or tab to its immediate left, since it would not be interpreted as a comment anyway.
ja: 注：セミコロンのすぐ左にスペースかタブ以外の文字がある場合は、コメントとして解釈されないので、エスケープする必要はない。

source: Note: Microsoft can assign an effect to an unassigned key code at any time.
ja: 注：マイクロソフトは、未使用のキーコードに機能を割り当てることがあります。

source: Note: Nested functions are not supported in this mode, as names may be resolved after the current function returns.
ja: 注：ネストされた関数は、現在の関数が戻った後に名前が解決される可能性があるため、このモードではサポートされていません。

source: Note: Omitting Length when the string is not null-terminated may cause an access violation which terminates the program, or some other undesired result.
ja: 注：文字列がヌル終端でない場合にLengthを省略すると、アクセス違反が発生し、プロ グラムが終了するなどの望ましくない結果を引き起こす可能性があります。

source: Note: On Windows 11, some of these options are usually relegated to a submenu that can be accessed by selecting "Show more options".
ja: 注：Windows 11では、これらのオプションの一部は通常サブメニューに追いやられ、「その他のオプションを表示」を選択することでアクセスすることができます。

source: Note: Options N and P are ignored when the \ (backslash) option is present.
ja: 注：NとPのオプションは、N(バックスラッシュ)オプションがある場合は無視されます。

source: Note: Passing an empty variable or an expression which results in an empty value is considered an error.
ja: 注：空の変数や空の値をもたらす式を渡すとエラーとみなされます。

source: Note: Pressing Ctrl+C while a message box is active will copy its text to the clipboard.
ja: 注意：メッセージボックスがアクティブな状態でCtrl+Cを押すと、そのテキストがクリップボードにコピーされます。

source: Note: Pressing a hotkey which includes Alt may result in extra simulated keystrokes (Ctrl by default).
ja: 注： Altを含むホットキーを押すと、余分なシミュレーションキー（デフォルトではCtrl）が発生する場合があります。

source: Note: Pressing a hotkey which includes Win may result in extra simulated keystrokes (Ctrl by default).
ja: 注： Winを含むホットキーを押すと、余分なシミュレーションキー（デフォルトではCtrl）を押すことになる場合があります。

source: Note: Properties defined by a method definition typically do not have a getter, so are skipped.
ja: 注：メソッド定義で定義されたプロパティは、通常ゲッターを持たないため、スキップされます。

source: Note: Run can also be used to open documents, folders and URLs.
ja: 注：「実行」は、ドキュメント、フォルダ、URLを開くためにも使用できます。

source: Note: Scripts should not assume that the expression is only evaluated when the key is pressed (see below).
ja: 注：スクリプトは、キーが押されたときだけ式が評価されることを想定してはいけません（下記参照）。

source: Note: See the Key List for a complete list of keyboard keys and mouse/controller buttons.
ja: 注：キーボートとマウス・ジョイスティックのボタンのリストは、キーリストをご覧ください。

source: Note: SendInput ignores SetKeyDelay because the operating system does not support a delay in this mode.
ja: 注：SendInputは、オペレーティングシステムがこのモードでの遅延をサポートしないため、SetKeyDelayを無視します。

source: Note: SendPlay may have no effect at all if User Account Control is enabled, even if the script is running as an administrator.
ja: 注意：ユーザーアカウント制御が有効な場合、スクリプトが管理者として実行されていても、SendPlayが全く効果を発揮しない場合があります。

source: Note: SetKeyDelay is not obeyed by SendInput; there is no delay between keystrokes in that mode.
ja: 注：SetKeyDelayはSendInputでは従わない。そのモードではキーストローク間の遅延はない。

source: Note: Some applications (e.g. Calc.exe) do not obey the requested startup state and thus Max/Min/Hide will have no effect.
ja: 注意：一部のアプリケーション（Calc.exeなど）は、要求されたスタートアップ状態に従わないため、Max/Min/Hideは効果を発揮しないことがあります。

source: Note: Spaces and tabs may optionally be used to separate each option from the next.
ja: 注：各オプションと次のオプションを区切るために、オプションでスペースとタブを使用することができます。
